In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('quiz/products.csv', encoding='utf-8')
df

   상품명    가격  재고
0   사과  3000  10
1  바나나  2000  20
2   포도  4000  15
3   딸기  5000   8

In [7]:
df = df.set_index('상품명')
df

       가격  재고
상품명
사과   3000  10
바나나  2000  20
포도   4000  15
딸기   5000   8

In [8]:
df.index

Index(['사과', '바나나', '포도', '딸기'], dtype='object', name='상품명')

In [9]:
df.loc['사과','가격']

np.int64(3000)

In [10]:
df.loc['바나나','재고']

np.int64(20)

In [11]:
df.loc['포도','가격'] = 4500
df

       가격  재고
상품명
사과   3000  10
바나나  2000  20
포도   4500  15
딸기   5000   8

In [12]:
df.loc['딸기','재고'] = 10
df

       가격  재고
상품명
사과   3000  10
바나나  2000  20
포도   4500  15
딸기   5000  10

In [14]:
df = pd.read_csv('quiz/sales.csv', encoding='euc-kr')
df

  month  sales  profit
0    1월   1000     200
1    2월   1500     300
2    3월   2000     400
3    4월   2500     500

In [15]:
df = df.set_index('month')
df

       sales  profit
month
1월      1000     200
2월      1500     300
3월      2000     400
4월      2500     500

In [19]:
df.columns

Index(['sales', 'profit'], dtype='object')

In [20]:
df.loc[:, 'sales']
# []는 열만 선택 가능

month
1월    1000
2월    1500
3월    2000
4월    2500
Name: sales, dtype: int64

In [21]:
df.loc['2월']

sales     1500
profit     300
Name: 2월, dtype: int64

In [25]:
print('합계:', df['profit'].sum(axis = 0))
print('평균:', df['profit'].mean(axis = 0))

합계: 1400
평균: 350.0

In [28]:
df[df['profit'] >= 300]

       sales  profit
month
2월      1500     300
3월      2000     400
4월      2500     500

In [32]:
df = pd.read_csv('quiz/weather.csv', encoding='euc-kr')
df

  city  spring  summer  winter
0   서울      15      28       2
1   부산      17      29       5
2   인천      14      27       3
3   대구      18      30       1

In [34]:
df.loc[:, 'spring']

0    15
1    17
2    14
3    18
Name: spring, dtype: int64

In [36]:
df.loc[0]

city      서울
spring    15
summer    28
winter     2
Name: 0, dtype: object

In [38]:
df['winter'].mean(axis = 0)

np.float64(2.75)

In [40]:
df[df['summer'] >= 28]

  city  spring  summer  winter
0   서울      15      28       2
1   부산      17      29       5
3   대구      18      30       1

In [41]:
df = pd.read_json('quiz/products.json')
df

   상품명    가격  재고
0   사과  3000  10
1  바나나  2000  20
2   포도  4000  15
3   딸기  5000   8

In [43]:
df[df['가격'] >= 3000]

  상품명    가격  재고
0  사과  3000  10
2  포도  4000  15
3  딸기  5000   8

In [53]:
int(df['가격'].mean())

3750

In [47]:
df = df.set_index('상품명')
df

       가격  재고
상품명
사과   3000  10
바나나  2000  20
포도   4000  15
딸기   5000   8

In [48]:
df['총액'] = df['가격'] * df['재고']
df

       가격  재고     총액
상품명
사과   3000  10  30000
바나나  2000  20  40000
포도   4000  15  60000
딸기   5000   8  40000

In [50]:
df.loc['딸기','가격'] = 6000
df

       가격  재고     총액
상품명
사과   3000  10  30000
바나나  2000  20  40000
포도   4000  15  60000
딸기   6000   8  40000

In [51]:
df = df.drop(['재고'], axis = 1)
df

       가격     총액
상품명
사과   3000  30000
바나나  2000  40000
포도   4000  60000
딸기   6000  40000

In [54]:
df = pd.read_json('quiz/books.json')
df

          제목   저자     가격  대출가능권수
0  데이터 분석 입문  김철수  18000       3
1  파이썬 프로그래밍  이영희  22000       5
2    머신러닝 기초  박민수  25000       2
3    인공지능 시대  최지연  30000       1
4  데이터베이스 개론  홍길동  20000       4

In [55]:
df[df['가격'] >= 20000]

          제목   저자     가격  대출가능권수
1  파이썬 프로그래밍  이영희  22000       5
2    머신러닝 기초  박민수  25000       2
3    인공지능 시대  최지연  30000       1
4  데이터베이스 개론  홍길동  20000       4

In [56]:
df[df['대출가능권수'] <= 2]

        제목   저자     가격  대출가능권수
2  머신러닝 기초  박민수  25000       2
3  인공지능 시대  최지연  30000       1

In [58]:
df.sort_values('가격', ascending = False)

          제목   저자     가격  대출가능권수
3    인공지능 시대  최지연  30000       1
2    머신러닝 기초  박민수  25000       2
1  파이썬 프로그래밍  이영희  22000       5
4  데이터베이스 개론  홍길동  20000       4
0  데이터 분석 입문  김철수  18000       3

In [59]:
df.sort_values('대출가능권수', ascending = False)

          제목   저자     가격  대출가능권수
1  파이썬 프로그래밍  이영희  22000       5
4  데이터베이스 개론  홍길동  20000       4
0  데이터 분석 입문  김철수  18000       3
2    머신러닝 기초  박민수  25000       2
3    인공지능 시대  최지연  30000       1

In [62]:
print(int(df['가격'].mean()))

23000